EXCEPTION_MESSAGE = ("Что-то пошло не так 🤷\n"
                     "Попробуй еще раз или чуть позже.\n\n"
                     "Если проблема не исчезнет обратись в поддержку и перешли это сообщение: @melowetty\n\n"
                     "Код ошибки: `#{}`")

UNREGISTERED_USER_EXCEPTION = ("Кажется, ты не авторизован 😔\n\n"
                               "Пройди авторизацию (/auth твой_код) и возвращайся 😊")

WRONG_CODE_COMMAND_EXCEPTION = ("Неверный формат команды 😔\n\n"
                                "Введите команду: `/auth <твой_код>`")
WRONG_CODE_EXCEPTION = ("Неверный код 😔\n\n"
                        "Попробуй еще раз или обратись к администраторy")

FORBIDDEN_EXCEPTION = ("Ты не можешь использовать этот бот, он нужен для волонтеров 😔\n\n"
                       "Напомним, бот для конференции: @hse\\_cub\\_bot")

SCANNER_TEXT = "Для открытия сканнера нажмите на кнопку ниже:"

WELCOME_TEXT = ("*Добро пожаловать в админку КУБа 👋*\n\n"
                "Чтобы прололжить работу, тебе необходимо пройти авторизацию.\n"
                "Для этого введи команду: `/auth <твой_код>`")

SUCCESSFUL_AUTH_TEXT = "Вы успешно авторизованы! Можете приступать к работе!"

MANAGE_COMMAND_TEXT = "Выберите действие:"
MANAGE_GENERATE_AUTH_CODE_TEXT = "Введите количество кодов, которое нужно сгенерировать:"

CANCEL_BUTTON_TEXT = "Отмена"